# CannotMakeTypeCB Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotMakeTypeCB Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't make type "[Family Name]".
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMakeTypeCB { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMakeTypeCB As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMakeTypeCB {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace